In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('gapminder_data_graphs.csv')

In [3]:
df.sample()

,country,continent,year,life_exp,hdi_index,co2_consump,gdp,services
1704,Jordan,Asia,2001,73.0,0.717,2.99,3710.0,74.9

In [4]:
df.columns

Index(['country', 'continent', 'year', 'life_exp', 'hdi_index', 'co2_consump',
       'gdp', 'services'],
      dtype='object')

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3675 entries, 0 to 3674
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   country      3675 non-null   object
 1   continent    3675 non-null   object
 2   year         3675 non-null   int64
 3   life_exp     3675 non-null   float64
 4   hdi_index    3563 non-null   float64
 5   co2_consump  3671 non-null   float64
 6   gdp          3633 non-null   float64
 7   services     3675 non-null   float64
dtypes: float64(5), int64(1), object(2)
memory usage: 229.8+ KB

In [6]:
df.sort_values('year', ascending=True)

,country,continent,year,life_exp,hdi_index,co2_consump,gdp,services
0,Afghanistan,Asia,1998,53.3,0.344,0.0522,NaN,24.4
1764,Kuwait,Asia,1998,78.5,0.780,28.2000,32500.0,75.8
21,Albania,Europe,1998,74.8,0.655,0.5630,1600.0,33.0
84,Argentina,South America,1998,73.7,0.763,3.8700,11400.0,74.4
2688,Qatar,Asia,1998,70.2,0.810,58.6000,NaN,62.6
...,...,...,...,...,...,...,...,...
2561,Panama,North America,2018,79.9,0.812,2.6200,14900.0,67.0
2645,Philippines,Asia,2018,71.6,0.711,1.2700,3500.0,56.6
2582,Papua New Guinea,Oceania,2018,64.4,0.549,0.9110,2750.0,30.1
20,Afghanistan,Asia,2018,62.7,0.509,0.2540,569.0,38.4
3674,Zimbabwe,Africa,2018,60.6,0.569,0.8500,1510.0,27.2

In [7]:
df.describe()

,year,life_exp,hdi_index,co2_consump,gdp,services
count,3675.000000,3675.000000,3563.000000,3671.000000,3633.000000,3675.000000
mean,2008.000000,69.849306,0.674864,4.712731,11966.053675,51.248705
std,6.056125,8.886563,0.164834,6.567435,17105.787953,18.312501
min,1998.000000,32.500000,0.255000,0.015900,238.000000,5.590000
25%,2003.000000,63.900000,0.537500,0.560500,1470.000000,37.600000
50%,2008.000000,71.700000,0.699000,2.250000,4280.000000,52.900000
75%,2013.000000,76.400000,0.805000,6.615000,13600.000000,65.700000
max,2018.000000,84.800000,0.956000,67.100000,105000.000000,88.500000

## Find the country where life exp is less than 40 years old

In [12]:
df['life_exp'] < 40

0       False
1       False
2       False
3       False
4       False
        ...
3670    False
3671    False
3672    False
3673    False
3674    False
Name: life_exp, Length: 3675, dtype: bool

In [13]:
df[df['life_exp'] < 40]

,country,continent,year,life_exp,hdi_index,co2_consump,gdp,services
1419,Haiti,North America,2010,32.5,0.471,0.211,1290.0,59.9

In [14]:
df[df['life_exp'] <= 40]

,country,continent,year,life_exp,hdi_index,co2_consump,gdp,services
1419,Haiti,North America,2010,32.5,0.471,0.211,1290.0,59.9

## Find the country where life exp is more than 80 years old

In [16]:
df['life_exp'] > 80

0       False
1       False
2       False
3       False
4       False
        ...
3670    False
3671    False
3672    False
3673    False
3674    False
Name: life_exp, Length: 3675, dtype: bool

In [15]:
df[df['life_exp'] > 80]

,country,continent,year,life_exp,hdi_index,co2_consump,gdp,services
129,Australia,Oceania,2001,80.1,0.905,18.60,45900.0,74.5
130,Australia,Oceania,2002,80.3,0.907,18.70,47200.0,74.7
131,Australia,Oceania,2003,80.6,0.909,18.90,48000.0,75.2
132,Australia,Oceania,2004,80.9,0.911,19.30,49400.0,75.0
133,Australia,Oceania,2005,81.2,0.906,19.20,50300.0,75.3
...,...,...,...,...,...,...,...,...
3502,United Kingdom,Europe,2014,81.1,0.925,6.71,44300.0,79.8
3503,United Kingdom,Europe,2015,81.0,0.923,6.42,45000.0,80.2
3504,United Kingdom,Europe,2016,81.1,0.924,6.04,45500.0,80.4
3505,United Kingdom,Europe,2017,81.2,0.926,5.81,45900.0,80.6
3506,United Kingdom,Europe,2018,81.0,0.928,5.65,46200.0,80.8

## Find rows of data where continent is Africa

In [19]:
df['continent'] == 'Africa'

0       False
1       False
2       False
3       False
4       False
        ...
3670     True
3671     True
3672     True
3673     True
3674     True
Name: continent, Length: 3675, dtype: bool

In [49]:
df[df['continent'] == 'Africa']

,country,continent,year,life_exp,hdi_index,co2_consump,gdp,services
42,Algeria,Africa,1998,70.2,0.621,3.530,2990.0,52.0
43,Algeria,Africa,1999,70.7,0.629,3.000,3040.0,52.5
44,Algeria,Africa,2000,71.0,0.637,2.820,3110.0,52.8
45,Algeria,Africa,2001,71.3,0.647,2.670,3160.0,53.3
46,Algeria,Africa,2002,71.8,0.657,2.810,3300.0,53.5
...,...,...,...,...,...,...,...,...
3670,Zimbabwe,Africa,2014,58.0,0.547,0.881,1440.0,25.4
3671,Zimbabwe,Africa,2015,58.6,0.553,0.881,1450.0,25.7
3672,Zimbabwe,Africa,2016,59.2,0.558,0.771,1430.0,26.1
3673,Zimbabwe,Africa,2017,59.9,0.563,0.845,1480.0,26.6
3674,Zimbabwe,Africa,2018,60.6,0.569,0.850,1510.0,27.2

In [22]:
df[df['continent'].isin(['Africa'])]

,country,continent,year,life_exp,hdi_index,co2_consump,gdp,services
42,Algeria,Africa,1998,70.2,0.621,3.530,2990.0,52.0
43,Algeria,Africa,1999,70.7,0.629,3.000,3040.0,52.5
44,Algeria,Africa,2000,71.0,0.637,2.820,3110.0,52.8
45,Algeria,Africa,2001,71.3,0.647,2.670,3160.0,53.3
46,Algeria,Africa,2002,71.8,0.657,2.810,3300.0,53.5
...,...,...,...,...,...,...,...,...
3670,Zimbabwe,Africa,2014,58.0,0.547,0.881,1440.0,25.4
3671,Zimbabwe,Africa,2015,58.6,0.553,0.881,1450.0,25.7
3672,Zimbabwe,Africa,2016,59.2,0.558,0.771,1430.0,26.1
3673,Zimbabwe,Africa,2017,59.9,0.563,0.845,1480.0,26.6
3674,Zimbabwe,Africa,2018,60.6,0.569,0.850,1510.0,27.2

## What if you want to find countries where life exp is greater than 50 and from Africa?

In [38]:
(df['continent'] == 'Africa')

0       False
1       False
2       False
3       False
4       False
        ...
3670     True
3671     True
3672     True
3673     True
3674     True
Name: continent, Length: 3675, dtype: bool

In [39]:
(df['life_exp'] > 50)

0       True
1       True
2       True
3       True
4       True
        ...
3670    True
3671    True
3672    True
3673    True
3674    True
Name: life_exp, Length: 3675, dtype: bool

In [44]:
df[(df['continent'] == 'Africa') & (df['life_exp'] > 50)]

,country,continent,year,life_exp,hdi_index,co2_consump,gdp,services
42,Algeria,Africa,1998,70.2,0.621,3.530,2990.0,52.0
43,Algeria,Africa,1999,70.7,0.629,3.000,3040.0,52.5
44,Algeria,Africa,2000,71.0,0.637,2.820,3110.0,52.8
45,Algeria,Africa,2001,71.3,0.647,2.670,3160.0,53.3
46,Algeria,Africa,2002,71.8,0.657,2.810,3300.0,53.5
...,...,...,...,...,...,...,...,...
3670,Zimbabwe,Africa,2014,58.0,0.547,0.881,1440.0,25.4
3671,Zimbabwe,Africa,2015,58.6,0.553,0.881,1450.0,25.7
3672,Zimbabwe,Africa,2016,59.2,0.558,0.771,1430.0,26.1
3673,Zimbabwe,Africa,2017,59.9,0.563,0.845,1480.0,26.6
3674,Zimbabwe,Africa,2018,60.6,0.569,0.850,1510.0,27.2

## What if you want to find countries where life exp is greater than 50 or country is from Africa?

In [47]:
df[(df['continent'] == 'Africa') | (df['life_exp'] > 50)]

,country,continent,year,life_exp,hdi_index,co2_consump,gdp,services
0,Afghanistan,Asia,1998,53.3,0.344,0.0522,NaN,24.4
1,Afghanistan,Asia,1999,54.7,0.348,0.0402,NaN,24.6
2,Afghanistan,Asia,2000,54.7,0.350,0.0370,NaN,24.7
3,Afghanistan,Asia,2001,54.8,0.353,0.0376,NaN,24.7
4,Afghanistan,Asia,2002,55.5,0.384,0.0471,333.0,25.6
...,...,...,...,...,...,...,...,...
3670,Zimbabwe,Africa,2014,58.0,0.547,0.8810,1440.0,25.4
3671,Zimbabwe,Africa,2015,58.6,0.553,0.8810,1450.0,25.7
3672,Zimbabwe,Africa,2016,59.2,0.558,0.7710,1430.0,26.1
3673,Zimbabwe,Africa,2017,59.9,0.563,0.8450,1480.0,26.6
3674,Zimbabwe,Africa,2018,60.6,0.569,0.8500,1510.0,27.2